<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"a662b1efe1fde44bf80cd2566c30b8259018fc485cfe5dd4ceef6146ce03c06b","plan_job_ref":"Job Terraform Plan #484 at https://github.com/cal-itp/data-infra/actions/runs/17504582719","plan_out_hash":"04a7627424566241ad32be981254ee4c6a68e853d9de6894d6b93ff92f7f9228","plan_hash":"e0936b83759cf1698a780d8a47861f1542aab377f2a278dbdad3e8218e835a7d","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/parse_and_validate_rt_v2/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "J05Kfg==" -> (known after apply)
!~      detect_md5hash      = "4AECYFCGCHhAUElBpnttDA==" -> "different hash"
!~      generation          = 1757099631452571 -> (known after apply)
        id                  = "calitp-composer-dags/parse_and_validate_rt_v2/METADATA.yml"
!~      md5hash             = "4AECYFCGCHhAUElBpnttDA==" -> (known after apply)
        name                = "dags/parse_and_validate_rt_v2/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #484](https://github.com/cal-itp/data-infra/actions/runs/17504582719)